     A*****************************************************************
     A** NOMBRE DE ARCHIVO: EJEMPLO                                  **
     A** AUTOR............: JORGE DE TRINIDAD ZEPEDA. NOVACOMP S.A.  **
     A** DESCRIPCIÓN......: ARCHIVO FISICO DE PROVINCIAS.            **
     A** FECHA............: OCTUBRE DE 2022.                        ** 
     A*****************************************************************
     A          R PROVINCIA                                             
     A            IDPRO          5A                                    
     A            NOMPRO        50A                                    
     A          K IDPRO                                                